In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('data/test1.csv')

In [5]:
df

  Symbol    Price
0   AAPL   120.34
1   NFLX    32.40
2   GOOG  1234.56
3     FB    24.42

# Todo
* Filtering
* Sorting
* Select Top K after filtering/sorting
* Join 2 dataframes on symbol

# Filtering
* Select all where price > 100

In [6]:
df.head(2)

  Symbol   Price
0   AAPL  120.34
1   NFLX   32.40

In [11]:
filtered_df = df[df.Price > 100]

In [12]:
filtered_df

  Symbol    Price
0   AAPL   120.34
2   GOOG  1234.56

# Sorting
* Sort by price

In [13]:
df.sort_values(by='Price')

  Symbol    Price
3     FB    24.42
1   NFLX    32.40
0   AAPL   120.34
2   GOOG  1234.56

In [14]:
df.sort_values(by='Price', ascending=False)

  Symbol    Price
2   GOOG  1234.56
0   AAPL   120.34
1   NFLX    32.40
3     FB    24.42

# Joining
* Join on symbol

In [19]:
df2 = pd.read_csv('data/test2.csv')

In [21]:
df2

  Symbol    Price
0   AAPL   130.34
1   GOOG  1134.56
2   NVDA     2.34

In [23]:
joined_df = df.join(df2, lsuffix='_left', rsuffix='_right')

In [24]:
joined_df

  Symbol_left  Price_left Symbol_right  Price_right
0        AAPL      120.34         AAPL       130.34
1        NFLX       32.40         GOOG      1134.56
2        GOOG     1234.56         NVDA         2.34
3          FB       24.42          NaN          NaN

In [25]:
joined_df2 = df.set_index('Symbol').join(df2.set_index('Symbol'), lsuffix='_left', rsuffix='_right')

In [26]:
joined_df2

        Price_left  Price_right
Symbol
AAPL        120.34       130.34
NFLX         32.40          NaN
GOOG       1234.56      1134.56
FB           24.42          NaN

In [27]:
outer_df = df.set_index('Symbol').join(df2.set_index('Symbol'), lsuffix='_left', rsuffix='_right', how='outer')

In [28]:
outer_df

        Price_left  Price_right
Symbol
AAPL        120.34       130.34
FB           24.42          NaN
GOOG       1234.56      1134.56
NFLX         32.40          NaN
NVDA           NaN         2.34

In [29]:
inner_df = df.set_index('Symbol').join(df2.set_index('Symbol'), lsuffix='_left', rsuffix='_right', how='inner')

In [30]:
inner_df

        Price_left  Price_right
Symbol
AAPL        120.34       130.34
GOOG       1234.56      1134.56